## Plan Result (nonprod_general - TerraformPlanApply)




<pre><code>Plan: 0 to add, 14 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_server.atlassian-server
  * azurerm_public_ip.app_gw
  * azurerm_storage_account.this
  * azurerm_user_assigned_identity.identity
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-dmz-subnet-nsg&#34;]
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-int-subnet-app-nsg&#34;]
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-int-subnet-dat-nsg&#34;]
  * module.networking.azurerm_network_security_group.this[&#34;atlassian-int-subnet-ops-nsg&#34;]
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-dat-nsg-allow_atlassian-int-subnet-app&#34;]
  * module.networking.azurerm_network_security_rule.rules[&#34;atlassian-int-subnet-dat-nsg-allow_atlassian-int-subnet-dat&#34;]
  * module.networking.azurerm_virtual_network.this[&#34;atlassian-dmz-nonprod-vnet&#34;]
  * module.networking.azurerm_virtual_network.this[&#34;atlassian-int-nonprod-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
      ~ tags                              = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-jira" -> null
          - ip_addresses = [
              - "10.0.4.135",
              - "10.0.4.197",
              - "10.0.4.198",
            ] -> null
          - name         = "appgw-backend-pool-jira" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.203",
              + "10.0.4.204",
              + "10.0.4.205",
            ]
          + name         = "appgw-backend-pool-jira"
        }

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

      ~ waf_configuration {
          ~ firewall_mode            = "Detection" -> "Prevention"
            # (6 unchanged attributes hidden)
        }

        # (16 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
      ~ tags                            = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password      = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
      ~ tags                              = {
          - "application"  = "atlassian" -> null
          - "autoShutdown" = "true" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_public_ip.app_gw will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/publicIPAddresses/atlassian-nonprod-public-ip"
        name                    = "atlassian-nonprod-public-ip"
      ~ tags                    = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod"
        name                               = "atlassiannonprod"
      ~ tags                               = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "identity" {
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/atlassian-nonprod-app-gateway-identity"
        name                = "atlassian-nonprod-app-gateway-identity"
      ~ tags                = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-dmz-subnet-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-dmz-subnet-nsg-nonprod"
        name                = "atlassian-networking-atlassian-dmz-subnet-nsg-nonprod"
      ~ tags                = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-int-subnet-app-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-app-nsg-nonprod"
        name                = "atlassian-networking-atlassian-int-subnet-app-nsg-nonprod"
      ~ tags                = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-int-subnet-dat-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-dat-nsg-nonprod"
        name                = "atlassian-networking-atlassian-int-subnet-dat-nsg-nonprod"
      ~ tags                = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_group.this["atlassian-int-subnet-ops-nsg"] will be updated in-place
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-ops-nsg-nonprod"
        name                = "atlassian-networking-atlassian-int-subnet-ops-nsg-nonprod"
      ~ tags                = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-dat-nsg-allow_atlassian-int-subnet-app"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
      - destination_port_range                     = "*" -> null
      ~ destination_port_ranges                    = [
          + "22",
          + "24007",
          + "24008",
          + "443",
          + "49152",
          + "49153",
          + "49154",
          + "49155",
          + "49156",
          + "49157",
          + "49158",
          + "49159",
          + "49160",
          + "5432",
          + "80",
        ]
        id                                         = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-dat-nsg-nonprod/securityRules/allow_atlassian-int-subnet-app"
        name                                       = "allow_atlassian-int-subnet-app"
        # (15 unchanged attributes hidden)
    }

  # module.networking.azurerm_network_security_rule.rules["atlassian-int-subnet-dat-nsg-allow_atlassian-int-subnet-dat"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
      - destination_port_range                     = "*" -> null
      ~ destination_port_ranges                    = [
          + "22",
          + "24007",
          + "24008",
          + "443",
          + "49152",
          + "49153",
          + "49154",
          + "49155",
          + "49156",
          + "49157",
          + "49158",
          + "49159",
          + "49160",
          + "5432",
          + "80",
        ]
        id                                         = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/atlassian-networking-atlassian-int-subnet-dat-nsg-nonprod/securityRules/allow_atlassian-int-subnet-dat"
        name                                       = "allow_atlassian-int-subnet-dat"
        # (15 unchanged attributes hidden)
    }

  # module.networking.azurerm_virtual_network.this["atlassian-dmz-nonprod-vnet"] will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
        id                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-nonprod-vnet"
        name                    = "atlassian-dmz-nonprod-vnet"
      ~ tags                    = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (9 unchanged attributes hidden)
    }

  # module.networking.azurerm_virtual_network.this["atlassian-int-nonprod-vnet"] will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
        id                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet"
        name                    = "atlassian-int-nonprod-vnet"
      ~ tags                    = {
            "application"  = "atlassian"
          - "autoShutdown" = "true" -> null
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 14 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->